---
kind: method
id: M:Autodesk.Revit.DB.BaseImportOptions.Dispose
source: html/c63a82c3-fb0a-c2a5-7a12-06da0b1937e8.htm
---
# Autodesk.Revit.DB.BaseImportOptions.Dispose Method

Releases all resources used by the BaseImportOptions

## Syntax (C#)
```csharp
public void Dispose()
```